export interface SideEffectData {
  general: string[];
  local: string[];
  rare?: string[];
  lowFrequency?: string[];
  contactDoctor: string[];
  excludeGeneral?: boolean;
}
export const vaccineSideEffects: { [key: string]: SideEffectData } = {
  الخامسة: {
    general: [],
    local: [
      'إحمرار',
      'حمي',
      'ألم',
      'حساسية أو انتفاخ في مكان الحقن',
      'تفاعلات حساسية طفيفة',
    ],
    lowFrequency: ['سيلان الأنف', 'سعال', 'حكة', 'طفح جلدي'],
    contactDoctor: [
      'إذا بدا الطفل أو الطفلة غير مبال.',
      'إذا كانت هناك حمي لا تزول بعد 24-48 ساعة.',
      'في حال تغيرات في الشهية وأنماط الأكل والتي لا تزول بعد 24-48 ساعة.',
      'إذا كانت هناك أعراض تسبب لك الخوف أو القلق.',
    ],
    rare: [
      'تشنجات لمدة تصل إلى 3 أيام بعد التطعيم.',
      'غالبًا تكون مرتبطة بارتفاع الحرارة، لا تُسبب ضرر دائم للأعصاب.',
    ],
    excludeGeneral: true,
  },
  الرابعة: {
    general: [],
    local: [
      'إحمرار',
      'حمي',
      'ألم',
      'حساسية أو انتفاخ في مكان الحقن',
      'تفاعلات حساسية طفيفة',
    ],
    lowFrequency: ['سيلان الأنف', 'سعال', 'حكة', 'طفح جلدي'],
    contactDoctor: [
      'إذا بدا الطفل أو الطفلة غير مبال.',
      'إذا كانت هناك حمي لا تزول بعد 24-48 ساعة.',
      'في حال تغيرات في الشهية وأنماط الأكل والتي لا تزول بعد 24-48 ساعة.',
      'إذا كانت هناك أعراض تسبب لك الخوف أو القلق.',
    ],
    rare: [
      'انخفاض في الصفائح الدموية (قلة الصفيحات)، مما يؤدي إلى نزيف أو بقع جلدية.',
    ],
    excludeGeneral: true,
  },
  'أي لقاح آخر': {
    general: [
      'الأرق',
      'ارتفاع درجة الحرارة',
      'النعاس',
      'تغيرات في الشهية أو اضطرابات في الجهاز الهضمي',
      'طفح جلدي.',
    ],
    local: [
      'إحمرار',
      'حمي',
      'ألم',
      'حساسية أو انتفاخ في مكان الحقن',
      'تفاعلات حساسية طفيفة',
    ],
    lowFrequency: ['سيلان الأنف', 'سعال', 'حكة', 'طفح جلدي'],
    contactDoctor: [
      'إذا بدا الطفل أو الطفلة غير مبال.',
      'إذا كانت هناك حمي لا تزول بعد 24-48 ساعة.',
      'في حال تغيرات في الشهية وأنماط الأكل والتي لا تزول بعد 24-48 ساعة.',
      'إذا كانت هناك أعراض تسبب لك الخوف أو القلق.',
    ],
  },
};
